#+TITLE:Manipulate files and data
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:OS Practice CSC 420 Spring 2022
#+STARTUP:overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:bash :exports both
#+PROPERTY: header-args:bash :results output
* Practice

  You can get this Org-mode file for practice from GitHub.

** Building a playground

   * Change to your ~$HOME~ directory
   * Check that ~$HOME~ is your working directory
   * Create a directory ~playground~
   * Check that it worked using the wildcard ~play*~

   #+name: make_playground
   #+begin_src bash
     cd $HOME
     pwd
     mkdir playground
     echo play*
   #+end_src

   #+RESULTS: playground
   : /home/pi
   : playground

** Creating directories

   * Change directory to ~playground~

   #+name: make_dirs

** Copying files

** Moving and renaming files

** Creating hard links

** Creating symbolic links

** Removing files and directories

** Clean up
** Command summary

   | COMMAND | MEANING |
   |---------+---------|
   | cd      |         |
   | pwd     |         |
   | mkdir   |         |
   | echo    |         |
